- Now that we understandan "inner" merge, let's explore "left" versus "right" merge conditions.
- Note: Order of the tables passed in as arguments does matter here!
<br><br>
- Let's explore an how="left" condition with our two example tables.
- Note: registrations is the left table, logins will be the right table
<img src="./assets/11/1-merge_1.png" width="600px" />
<br><br>
- pd.merge(registrations, logins, how='left', on='name')
<img src="./assets/11/1-merge_2.png" width="600px" />
<img src="./assets/11/1-merge_3.png" width="600px" />
<br><br>
- pd.mrge(registrations, logins, how='right', on='name')
<img src="./assets/11/1-merge_4.png" width="600px" />

In [17]:
import pandas as pd
import numpy as np

In [18]:
registrations = pd.DataFrame({'reg_id': [1, 2, 3, 4], 'name': ['Andrew', 'BoBo','Claire','David']})
logins = pd.DataFrame({'log_id': [1, 2, 3, 4], 'name': ['Xavier', 'Andrew','Yolanda','BoBo']})

In [19]:
registrations

   reg_id    name
0       1  Andrew
1       2    BoBo
2       3  Claire
3       4   David

In [20]:
logins

   log_id     name
0       1   Xavier
1       2   Andrew
2       3  Yolanda
3       4     BoBo

In [21]:
# left Join
pd.merge(left=registrations, right=logins, how='left', on='name')

   reg_id    name  log_id
0       1  Andrew     2.0
1       2    BoBo     4.0
2       3  Claire     NaN
3       4   David     NaN

In [22]:
# Right Join
pd.merge(left=registrations, right=logins, how='right', on='name')

   reg_id     name  log_id
0     1.0   Andrew       2
1     2.0     BoBo       4
2     NaN   Xavier       1
3     NaN  Yolanda       3

In [23]:
# pd.merge(registrations, logins, left_index=True, right_on='name', how='inner')